espressif/esp-idf/components/esp_hal_touch_sens/esp32h4/include/hal/touch_sensor_ll.h
/**
 * Set debounce count, such as `n`. If the measured values continue to exceed
 * the threshold for `n+1` times, it is determined that the touch sensor state changes.
 *
 * @param dbc_cnt Debounce count value.
 */
static inline void touch_ll_filter_set_debounce(uint32_t dbc_cnt)
{
    TOUCH_AON.aon_filter1.aon_touch_debounce_limit = dbc_cnt;
}

/**
 * Set the denoise coefficient regarding the denoise level.
 *
 * @param denoise_lvl   Range [0 ~ 4]. 0 = no noise resistance, otherwise higher denoise_lvl means more noise resistance.
 */
static inline void touch_ll_filter_set_denoise_level(int denoise_lvl)
{
    HAL_ASSERT(denoise_lvl >= 0 && denoise_lvl <= 4);
    bool always_update = denoise_lvl == 0;
    // Map denoise level to actual noise threshold coefficients
    uint32_t noise_thresh = denoise_lvl == 4 ? 3 : 3 - denoise_lvl;

    TOUCH_AON.aon_filter2.aon_touch_bypass_noise_thres = always_update;
    TOUCH_AON.aon_filter1.aon_touch_noise_thres = always_update ? 0 : noise_thresh;

    TOUCH_AON.aon_filter2.aon_touch_bypass_nn_thres = always_update;
    TOUCH_AON.aon_filter1.aon_touch_nn_thres = always_update ? 0 : noise_thresh;
    TOUCH_AON.aon_filter1.aon_touch_nn_limit = 5; // 5 is the default value
}

/**
 * Set the hysteresis value of the active threshold
 * While the touch data is greater than active_threshold + hysteresis and last for several ticks, the channel is activated,
 * and while the touch data is smaller than active_threshold - hysteresis and last for several ticks, the channel is inactivated
 *
 * @param hysteresis The hysteresis value of active threshold
 */
static inline void touch_ll_filter_set_active_hysteresis(uint32_t hysteresis)
{
    TOUCH_AON.aon_filter1.aon_touch_hysteresis = hysteresis;
}

/**
 * Set jitter filter step size.
 * If filter mode is jitter, should set filter step for jitter.
 * Range: 0 ~ 15
 *
 * @param step The step size of the data change.
 */
static inline void touch_ll_filter_set_jitter_step(uint32_t step)
{
    TOUCH_AON.aon_filter1.aon_touch_jitter_step = step;
}

/**
 * Enable or disable touch sensor filter and detection algorithm.
 * For more details on the detection algorithm, please refer to the application documentation.
 */
static inline void touch_ll_filter_enable(bool enable)
{
    TOUCH_AON.aon_filter1.aon_touch_filter_en = enable;
}

/**
 * Force the update the benchmark by software
 * @note  This benchmark will be applied to all enabled channel and all sampling frequency
 *
 * @param pad_num The pad number, range [1-14]
 * @param sample_cfg_id The sample configuration index, range [0-2]
 * @param benchmark The benchmark specified by software
 */
static inline void touch_ll_force_update_benchmark(uint32_t pad_num, uint8_t sample_cfg_id, uint32_t benchmark)
{
    TOUCH_AON.aon_filter3.aon_touch_update_benchmark_pad_sel = pad_num;
    TOUCH_AON.aon_filter3.aon_touch_update_benchmark_freq_sel = sample_cfg_id;
    HAL_FORCE_MODIFY_U32_REG_FIELD(TOUCH_AON.aon_filter3, aon_touch_benchmark_sw, benchmark);
    TOUCH_AON.aon_filter3.aon_touch_update_benchmark_sw = 1;
    // waiting for update
    while (TOUCH_AON.aon_filter3.aon_touch_update_benchmark_sw);
}

/************************ Waterproof register setting ************************/

/**
 * Set touch channel use for guard pad.
 *
 * @param pad_num Touch sensor channel number.
 */
static inline void touch_ll_waterproof_set_guard_chan(uint32_t pad_num)
{
    TOUCH_AON.aon_scan_ctrl2.aon_touch_out_ring = pad_num;
}

/**
 * Enable or disable parameter of waterproof function.
 *
 * The waterproof function includes a shielded channel (TOUCH_PAD_NUM14) and a guard channel.
 * Guard pad is used to detect the large area of water covering the touch panel.
 * Shield pad is used to shield the influence of water droplets covering the touch panel.
 * It is generally designed as a grid and is placed around the touch buttons.
 */
static inline void touch_ll_waterproof_enable(bool enable)
{
    TOUCH_AON.aon_scan_ctrl1.aon_touch_shield_pad_en = enable;
}

/**
 * Set the shield channel mask
 *
 * @param mask The channels that set in the mask will be used as shield channel
 */
static inline void touch_ll_waterproof_set_shield_chan_mask(uint32_t mask)
{
    TOUCH_AON.aon_mux0.aon_touch_bufsel = mask;
}

/**
 * Set the touch buff driver for the shield channel.
 *
 * @param driver_level The driver level of the touch buff
 */
static inline void touch_ll_waterproof_set_shield_driver(touch_chan_shield_cap_t driver_level)
{
    TOUCH_AON.aon_ana_para.aon_touch_touch_buf_drv = driver_level;
}

/************************ Approach register setting ************************/

/**
 * Set the proximity sensing channel to the specific touch channel
 * To disable the proximity channel, point this pad to `TOUCH_LL_NULL_CHANNEL`
 *
 * @param prox_chan  proximity sensing channel.
 * @param touch_num  The touch channel that supposed to be used as proximity sensing channel
 */
static inline void touch_ll_set_proximity_sensing_channel(uint8_t prox_chan, uint32_t touch_num)
{
    switch (prox_chan) {
    case 0:
        TOUCH_AON.aon_approach.aon_touch_approach_pad0 = touch_num;
        break;
    case 1:
        TOUCH_AON.aon_approach.aon_touch_approach_pad1 = touch_num;
        break;
    case 2:
        TOUCH_AON.aon_approach.aon_touch_approach_pad2 = touch_num;
        break;
    default:
        // invalid proximity channel
        abort();
    }
}

/**
 * Set the total scan times of the proximity sensing channel.
 *
 * @param scan_times The total scan times of the proximity sensing channel
 */
static inline void touch_ll_proximity_set_total_scan_times(uint32_t scan_times)
{
    HAL_FORCE_MODIFY_U32_REG_FIELD(TOUCH_AON.aon_filter1, aon_touch_approach_limit, scan_times);
}

/**
 * Set charge times for each sample configuration in proximity sensing mode.
 *
 * @param sample_cfg_id The sample configuration index
 * @param charge_times The charge and discharge times.
 */
static inline void touch_ll_proximity_set_charge_times(uint8_t sample_cfg_id, uint32_t charge_times)
{
    switch (sample_cfg_id) {
    case 0:
        TOUCH_AON.aon_approach_work_meas_num.aon_touch_approach_meas_num0 = charge_times;
        break;
    case 1:
        TOUCH_AON.aon_approach_work_meas_num.aon_touch_approach_meas_num1 = charge_times;
        break;
    case 2:
        TOUCH_AON.aon_approach_work_meas_num.aon_touch_approach_meas_num2 = charge_times;
        break;
    default:
        // invalid sample_cfg_id
        abort();
    }
}

/**
 * Read current cumulative measurement times for proximity sensing channel.
 *
 * @param prox_chan proximity sensing channel.
 * @param cnt The cumulative number of measurement cycles.
 */
static inline void touch_ll_proximity_read_measure_cnt(uint8_t prox_chan, uint32_t *cnt)
{
    switch (prox_chan) {
    case 0:
        *cnt = HAL_FORCE_READ_U32_REG_FIELD(TOUCH_SENS.aprch_ch_data, approach_pad0_cnt);
        break;
    case 1:
        *cnt = HAL_FORCE_READ_U32_REG_FIELD(TOUCH_SENS.aprch_ch_data, approach_pad1_cnt);
        break;
    case 2:
        *cnt = HAL_FORCE_READ_U32_REG_FIELD(TOUCH_SENS.aprch_ch_data, approach_pad2_cnt);
        break;
    default:  // sleep channel
        *cnt = HAL_FORCE_READ_U32_REG_FIELD(TOUCH_SENS.aprch_ch_data, slp_approach_cnt);
        break;
    }
}

/**
 * Check if the touch sensor channel is the proximity sensing channel.
 *
 * @param touch_num The touch sensor channel number.
 */
static inline bool touch_ll_is_proximity_sensing_channel(uint32_t touch_num)
{
    if ((TOUCH_AON.aon_approach.aon_touch_approach_pad0 != touch_num)
            && (TOUCH_AON.aon_approach.aon_touch_approach_pad1 != touch_num)
            && (TOUCH_AON.aon_approach.aon_touch_approach_pad2 != touch_num)) {
        return false;
    }
    return true;
}

/************** sleep channel setting ***********************/

/**
 * Set touch channel number for sleep channel.
 *
 * @note Only one touch sensor channel is supported in deep sleep mode.
 * @param touch_num Touch sensor channel number.
 */
static inline void touch_ll_sleep_set_channel_num(uint32_t touch_num)
{
    TOUCH_AON.aon_slp0.aon_touch_slp_pad = touch_num;
}

/**
 * Get touch channel number for sleep pad.
 *
 * @note Only one touch sensor channel is supported in deep sleep mode.
 * @param touch_num Touch sensor channel number.
 */
static inline void touch_ll_sleep_get_channel_num(uint32_t *touch_num)
{
    *touch_num = (uint32_t)(TOUCH_AON.aon_slp0.aon_touch_slp_pad);
}

/**
 * Set the trigger threshold of touch sensor in deep sleep.
 * The threshold determines the sensitivity of the touch sensor.
 * The threshold is the original value of the trigger state minus the benchmark value.
 *
 * @note In general, the touch threshold during sleep can use the threshold parameter parameters before sleep.
 */
static inline void touch_ll_sleep_set_threshold(uint8_t sample_cfg_id, uint32_t touch_thresh)
{
    switch (sample_cfg_id) {
    case 0:
        HAL_FORCE_MODIFY_U32_REG_FIELD(TOUCH_AON.aon_slp0, aon_touch_slp_th0, touch_thresh);
        break;
    case 1:
        HAL_FORCE_MODIFY_U32_REG_FIELD(TOUCH_AON.aon_slp1, aon_touch_slp_th1, touch_thresh);
        break;
    case 2:
        HAL_FORCE_MODIFY_U32_REG_FIELD(TOUCH_AON.aon_slp1, aon_touch_slp_th2, touch_thresh);
        break;
    default:
        // invalid sample_cfg_id
        abort();
    }
}

/**
 * Set the touch sensor wait ticks after PMU is woken up by touch timer during the sleep.
 * @note The PMU will be woken up after the measure interval timer time-up,
 *       PMU needs some time to prepare the clock and power for the touch sensor,
 *       If the wait ticks is too short, the touch sensor can't work properly and fail to wakeup the chip from sleep.
 *
 * @param wait_ticks    The wait ticks after PMU is woken up by touch FSM during the sleep.
 *                      Typically recommended to set it to the max value,
 *                      the PMU will start the touch sensor FSM immediately after the PMU enters HP SLEEP state.
 */
static inline void touch_ll_sleep_set_measure_wait_ticks(uint32_t wait_ticks)
{
    PMU.touch_pwr_ctrl.touch_wait_cycles = wait_ticks;
}

/**
 * Enable proximity sensing function for sleep channel.
 */
static inline void touch_ll_sleep_enable_proximity_sensing(bool enable)
{
    TOUCH_AON.aon_approach.aon_touch_slp_approach_en = enable;
}

/**
 * Get the data of the touch channel according to the types
 *
 * @param sample_cfg_id The sample configuration index
 * @param type  data type
 *              0/1: TOUCH_LL_READ_RAW, the raw data of the touch channel
 *              2:   TOUCH_LL_READ_BENCHMARK, benchmark value of touch channel,
 *                   the benchmark value is the maximum during the first measurement period
 *              3:   TOUCH_LL_READ_SMOOTH, the smoothed data that obtained by filtering the raw data.
 * @param smooth_data pointer to smoothed data
 */
__attribute__((always_inline))
static inline void touch_ll_sleep_read_chan_data(uint8_t type, uint8_t sample_cfg_id, uint32_t *data)
{
    HAL_ASSERT(type <= TOUCH_LL_READ_SMOOTH);
    TOUCH_AON.aon_mux0.aon_touch_freq_sel = sample_cfg_id + 1;
    TOUCH_AON.aon_mux0.aon_touch_data_sel = type;
    *data = HAL_FORCE_READ_U32_REG_FIELD(TOUCH_SENS.slp_ch_data, slp_data);
}

/**
 * @brief Reset the benchmark of the sleep channel
 *
 */
static inline void touch_ll_sleep_reset_benchmark(void)
{
    TOUCH_AON.aon_slp0.aon_touch_slp_channel_clr = 1;
}

/**
 * Read debounce of touch sensor for sleep channel.
 *
 * @param debounce Pointer to accept touch sensor debounce value.
 */
static inline void touch_ll_sleep_read_debounce(uint32_t *debounce)
{
    *debounce = TOUCH_SENS.slp_ch_data.slp_debounce_cnt;
}

/**
 * Read proximity count of touch sensor for sleep channel.
 * @param prox_cnt Pointer to accept touch sensor proximity count value.
 */
static inline void touch_ll_sleep_read_proximity_cnt(uint32_t *prox_cnt)
{
    *prox_cnt = HAL_FORCE_READ_U32_REG_FIELD(TOUCH_SENS.aprch_ch_data, slp_approach_cnt);
}

/**
 * @brief Enable or disable the internal capacitor, mainly for debug
 *
 * @param enable enable or disable the internal capacitor
 */
static inline void touch_ll_enable_internal_capacitor(bool enable)
{
    TOUCH_AON.aon_ana_para.aon_touch_touch_en_cal = enable;
}

/**
 * @brief Set the internal capacitor, mainly for debug
 * @note  Only take effect when the internal capacitor is enabled
 *
 * @param cap the capacitor value
 */
static inline void touch_ll_set_internal_capacitor(uint32_t cap)
{
    TOUCH_AON.aon_ana_para.aon_touch_touch_dcap_cal = cap;
}

#ifdef __cplusplus
}
#endif
